app/controllers/api/v1/events_controller.rb

  def update_invitations
    @invite = Invite.find_by(id: params[:id])
    if @invite
      @invite.update(status: params[:status])
---
SELECT "invites".* FROM "invites" WHERE "invites"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "invites" SET "status" = $1, "updated_at" = $2 WHERE "invites"."id" = $3  [["status", "Accepted"], ["updated_at", "2021-03-30 07:18:14.971437"], ["id", 2]]

  def create
    @event = Event.new(event_params)

    if @event.save
---
INSERT INTO "events" ("name", "description", "time", "duration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_user
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]