app/models/user_event.rb

  def create_invite
    Invite.create(sender_id: user.id, recipient_id: user.id, email: user.email, event_id: event.id)
---
INSERT INTO "invites" ("email", "created_at", "updated_at", "sender_id", "recipient_id", "event_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "dee1@12.com"], ["created_at", "2021-03-30 09:35:51.037806"], ["updated_at", "2021-03-30 09:35:51.037806"], ["sender_id", 4], ["recipient_id", 4], ["event_id", 7]]